## Terraform Plan Output
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.mgmt_vpc.aws_eip.nat["mgmt_public_apne2a_nat"] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "mgmt_public_apne2a_nat-eip"
        }
      + tags_all             = {
          + "Name" = "mgmt_public_apne2a_nat-eip"
        }
      + vpc                  = (known after apply)
    }

  # module.mgmt_vpc.aws_eip.nat["mgmt_public_apne2c_nat"] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "mgmt_public_apne2c_nat-eip"
        }
      + tags_all             = {
          + "Name" = "mgmt_public_apne2c_nat-eip"
        }
      + vpc                  = (known after apply)
    }

  # module.mgmt_vpc.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "mgmt-vpc-igw"
        }
      + tags_all = {
          + "Name" = "mgmt-vpc-igw"
        }
      + vpc_id   = (known after apply)
    }

  # module.mgmt_vpc.aws_nat_gateway.nat["mgmt_public_apne2a_nat"] will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "mgmt_public_apne2a_nat"
        }
      + tags_all                           = {
          + "Name" = "mgmt_public_apne2a_nat"
        }
    }

  # module.mgmt_vpc.aws_nat_gateway.nat["mgmt_public_apne2c_nat"] will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "mgmt_public_apne2c_nat"
        }
      + tags_all                           = {
          + "Name" = "mgmt_public_apne2c_nat"
        }
    }

  # module.mgmt_vpc.aws_route.private_default_route["mgmt_private_apne2a_route_table"] will be created
  + resource "aws_route" "private_default_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.mgmt_vpc.aws_route.private_default_route["mgmt_private_apne2c_route_table"] will be created
  + resource "aws_route" "private_default_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.mgmt_vpc.aws_route.public_default_route["mgmt_public_route_table"] will be created
  + resource "aws_route" "public_default_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.mgmt_vpc.aws_route_table.private["mgmt_private_apne2a_route_table"] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "mgmt_private_apne2a_route_table"
        }
      + tags_all         = {
          + "Name" = "mgmt_private_apne2a_route_table"
        }
      + vpc_id           = (known after apply)
    }

  # module.mgmt_vpc.aws_route_table.private["mgmt_private_apne2c_route_table"] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "mgmt_private_apne2c_route_table"
        }
      + tags_all         = {
          + "Name" = "mgmt_private_apne2c_route_table"
        }
      + vpc_id           = (known after apply)
    }

  # module.mgmt_vpc.aws_route_table.public["mgmt_public_route_table"] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "mgmt_public_route_table"
        }
      + tags_all         = {
          + "Name" = "mgmt_public_route_table"
        }
      + vpc_id           = (known after apply)
    }

  # module.mgmt_vpc.aws_route_table_association.private_assoc["mgmt_private_apne2a_route_table-mgmt_private_apne2a_subnet"] will be created
  + resource "aws_route_table_association" "private_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.mgmt_vpc.aws_route_table_association.private_assoc["mgmt_private_apne2c_route_table-mgmt_private_apne2c_subnet"] will be created
  + resource "aws_route_table_association" "private_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.mgmt_vpc.aws_route_table_association.public_assoc["mgmt_public_route_table-mgmt_public_apne2a_subnet"] will be created
  + resource "aws_route_table_association" "public_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.mgmt_vpc.aws_route_table_association.public_assoc["mgmt_public_route_table-mgmt_public_apne2c_subnet"] will be created
  + resource "aws_route_table_association" "public_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.mgmt_vpc.aws_subnet.private_subnet["mgmt_private_apne2a_subnet"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "mgmt_private_apne2a_subnet"
        }
      + tags_all                                       = {
          + "Name" = "mgmt_private_apne2a_subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.mgmt_vpc.aws_subnet.private_subnet["mgmt_private_apne2c_subnet"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "mgmt_private_apne2c_subnet"
        }
      + tags_all                                       = {
          + "Name" = "mgmt_private_apne2c_subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.mgmt_vpc.aws_subnet.public_subnet["mgmt_public_apne2a_subnet"] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "mgmt_public_apne2a_subnet"
        }
      + tags_all                                       = {
          + "Name" = "mgmt_public_apne2a_subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.mgmt_vpc.aws_subnet.public_subnet["mgmt_public_apne2c_subnet"] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "mgmt_public_apne2c_subnet"
        }
      + tags_all                                       = {
          + "Name" = "mgmt_public_apne2c_subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.mgmt_vpc.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "mgmt-vpc"
        }
      + tags_all                             = {
          + "Name" = "mgmt-vpc"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```